function cyr_to_lat(text) {
	const gost = {
		'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd',
		'е': 'e', 'ё': 'e', 'ж': 'zh', 'з': 'z', 'и': 'i',
		'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n',
		'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't',
		'у': 'u', 'ф': 'f', 'х': 'kh', 'ц': 'tz', 'ч': 'ch',
		'ш': 'sh', 'щ': 'sch', 'ы': 'y', 'э': 'e', 'ю': 'iu',
		'я': 'ia',
		'А': 'A', 'Б': 'B', 'В': 'V', 'Г': 'G', 'Д': 'D',
		'Е': 'E', 'Ё': 'E', 'Ж': 'Zh', 'З': 'Z', 'И': 'I',
		'Й': 'Y', 'К': 'K', 'Л': 'L', 'М': 'M', 'Н': 'N',
		'О': 'O', 'П': 'P', 'Р': 'R', 'С': 'S', 'Т': 'T',
		'У': 'U', 'Ф': 'F', 'Х': 'Kh', 'Ц': 'Tz', 'Ч': 'Ch',
		'Ш': 'Sh', 'Щ': 'Sch', 'Ы': 'Y', 'Э': 'E', 'Ю': 'Iu',
		'Я': 'Ia',
		'ь': '', 'Ь': '', 'ъ': '', 'Ъ': '',
		'ї': 'yi',
		'і': 'i',
		'ґ': 'g',
		'є': 'e',
		'Ї': 'Yi',
		'І': 'I',
		'Ґ': 'G',
		'Є': 'E'
	};

	return text.split('').map(function (char) { 
		return gost[char] || char; 
	}).join('');
}

function slug(text) {
	return cyr_to_lat(text).replaceAll(/[^A-Za-z0-9-]+/g, '-').replaceAll(/[\-]+/g, '-').replace(/^-/, '').replace(/-$/, '').toLowerCase();
}